$(document).ready(function(){
    loadprovince();
    $(".province").closest('body').find('.city').addClass( "temp09120217432class" );
    loadCity($(".province").val());
    $(".province").change(function(){
        $(this).closest('body').find('.city').addClass( "temp09120217432class" );
        loadCity($(this).val());
    });
});

function loadprovince() {
    selectValues = {"":"","آذربایجان‌شرقی":"آذربایجان شرقی","آذربایجان‌غربی":"آذربایجان غربی","اردبیل":"اردبیل","اصفهان":"اصفهان","البرز":"البرز","ایلام":"ایلام",
        "بوشهر":"بوشهر","تهران":"تهران","چهارمحال‌و‌بختیاری":"چهارمحال و بختیاری","خراسان‌جنوبی":"خراسان جنوبی","خراسان‌رضوی":"خراسان رضوی","خراسان‌شمالی":"خراسان شمالی","خوزستان":"خوزستان",
        "زنجان":"زنجان","سمنان":"سمنان","سیستان‌و‌بلوچستان":"سیستان و بلوچستان","فارس":"فارس","قزوین":"قزوین","قم":"قم","کردستان":"کردستان",
        "کرمان":"کرمان","کرمانشاه":"کرمانشاه","کهکیلویه‌و‌بویراحمد":"کهگیلویه و بویراحمد","گلستان":"گلستان","گیلان":"گیلان","لرستان":"لرستان","مازندران":"مازندران",
        "مرکزی":"مرکزی","هرمزگان":"هرمزگان","همدان":"همدان","یزد":"یزد"};

    $.each(selectValues, function (key, value) {
        $('.province')
            .append($("<option></option>")
                .attr("value", key)
                .text(value));
    });

}

//Load city for selete
function loadCity(province){
    $(".temp09120217432class").find('option').remove();

    switch (province) {
        case "آذربایجان‌شرقی":
            var selectValues = {"اچاچي":"اچاچي","اسکو":"اسکو","اهر":"اهر","ایلخچی":"ایلخچی","آبش‌احمد":"آبش‌احمد","آذرشهر":"آذرشهر","آقکند":"آقکند","باروق":"باروق","باسمنج":"باسمنج","بخشایش":"بخشایش","بستان‌آباد":"بستان‌آباد","بناب":"بناب","بناب مرند":"بناب مرند","تبریز":"تبریز","ترک":"ترک","ترکمانچاي":"ترکمانچاي","تسوج":"تسوج","تیکمه‌داش":"تیکمه‌داش","تيمورلو":"تيمورلو","جلفا":"جلفا","جوان قلعه":"جوان قلعه","خامنه":"خامنه","خراجو":"خراجو","خسروشاه":"خسروشاه","خمارلو":"خمارلو","خواجه":"خواجه","دوزدوزان":"دوزدوزان","زرنق":"زرنق","زنوز":"زنوز","سراب":"سراب","سردرود":"سردرود","سهند":"سهند","سیس":"سیس","سیه‌رود":"سیه‌رود","شبستر":"شبستر","شربیان":"شربیان","شرفخانه":"شرفخانه","شندآباد":"شندآباد","صوفیان":"صوفیان","عجب‌شیر":"عجب‌شیر","قره‌آغاج":"قره‌آغاج","کُشکسرای":"کُشکسرای","کلوانق":"کلوانق","کلیبر":"کلیبر","کوزه‌کنان":"کوزه‌کنان","گوگان":"گوگان","لیلان":"لیلان","مبارک شهر":"مبارک شهر","مراغه":"مراغه","مرند":"مرند","ملکان":"ملکان","ممقان":"ممقان","مهربان":"مهربان","میانه":"میانه","نظرکهريزي":"نظرکهريزي","وایقان":"وایقان","ورزقان":"ورزقان","هادیشهر":"هادیشهر","هریس":"هریس","هشترود":"هشترود","هوراند":"هوراند","یامچی":"یامچی"};
            break;
        case "آذربایجان‌غربی":
            var selectValues = {"ارومیه":"ارومیه","اشنویه":"اشنویه","ایواوغلی":"ایواوغلی","آواجیق":"آواجیق","باروق":"باروق","بازرگان":"بازرگان","بوکان":"بوکان","پلدشت":"پلدشت","پيرانشهر":"پيرانشهر","تازه شهر":"تازه شهر","تکاب":"تکاب","چهاربرج":"چهاربرج","خليفان":"خليفان","خوی":"خوی","ديزج ديز":"ديزج ديز","ربط":"ربط","زرآباد":"زرآباد","سردشت":"سردشت","سرو":"سرو","سلماس":"سلماس","سیلوانه":"سیلوانه","سیمینه":"سیمینه","سیه‌چشمه":"سیه‌چشمه","شاهین دژ":"شاهین دژ","شوط":"شوط","فیرورق":"فیرورق","قره ضیاءالدین":"قره ضیاءالدین","کشاورز":"کشاورز","گردکشانه":"گردکشانه","ماکو":"ماکو","محمدیار":"محمدیار","محمودآباد":"محمودآباد","مرگنلر":"مرگنلر","مهاباد":"مهاباد","میاندوآب":"میاندوآب","میرآباد":"میرآباد","نازك عليا":"نازك عليا","نالوس":"نالوس","نقده":"نقده","نوشين":"نوشين"};
            break;
        case "اردبیل":
            var selectValues = {"آبی‌بیگلو":"آبی‌بیگلو","اردبیل":"اردبیل","اسلام آباد":"اسلام آباد","اصلاندوز":"اصلاندوز","بیله‌سوار":"بیله‌سوار","پارس‌آباد":"پارس‌آباد","تازه کند":"تازه کند","تازه كندانگوت":"تازه كندانگوت","جعفرآباد":"جعفرآباد","خلخال":"خلخال","رضی":"رضی","سرعین":"سرعین","عنبران":"عنبران","فخرآباد":"فخرآباد","قصابه":"قصابه","کلور":"کلور","كوراييم":"كوراييم","گرمی":"گرمی","گیوی":"گیوی","لاهرود":"لاهرود","مرادلو":"مرادلو","مشگین شهر":"مشگین شهر","نمین":"نمین","نیر":"نیر","هشتجین":"هشتجین","هیر":"هیر"};
            break;
        case "اصفهان":
            var selectValues = {"ابريشم":"ابريشم","ابوزيدآباد":"ابوزيدآباد","اردستان":"اردستان","اژيه":"اژيه","اصغرآباد":"اصغرآباد","اصفهان":"اصفهان","افوس":"افوس","انارک":"انارک","ايمانشهر":"ايمانشهر","آران وبيدگل":"آران وبيدگل","بادرود":"بادرود","باغ بهادران":"باغ بهادران","باغشاد":"باغشاد","بافران":"بافران","برزک":"برزک","برف انبار":"برف انبار","بويين ومياندشت":"بويين ومياندشت","بهاران شهر":"بهاران شهر","بهارستان":"بهارستان","پيربکران":"پيربکران","تودشک":"تودشک","تيران":"تيران","جندق":"جندق","جوزدان":"جوزدان","جوشقان قالي":"جوشقان قالي","چادگان":"چادگان","چرمهين":"چرمهين","چمگردان":"چمگردان","حبيب آباد":"حبيب آباد","حسن اباد":"حسن اباد","حنا":"حنا","خالدآباد":"خالدآباد","خميني شهر":"خميني شهر","خوانسار":"خوانسار","خور":"خور","خورزوق":"خورزوق","داران":"داران","دامنه":"دامنه","درچه":"درچه","دستگرد":"دستگرد","دولت آباد":"دولت آباد","دهاقان":"دهاقان","دهق":"دهق","ديزيچه":"ديزيچه","رزوه":"رزوه","رضوانشهر":"رضوانشهر","زازران":"زازران","زاينده رود":"زاينده رود","زرين شهر":"زرين شهر","زواره":"زواره","زيار":"زيار","زيباشهر":"زيباشهر","سجزي":"سجزي","سده لنجان":"سده لنجان","سفيدشهر":"سفيدشهر","سميرم":"سميرم","سين":"سين","شاپورآباد":"شاپورآباد","شاهين شهر":"شاهين شهر","شهرضا":"شهرضا","طالخونچه":"طالخونچه","طرق رود":"طرق رود","عسگران":"عسگران","علويجه":"علويجه","فرخي":"فرخي","فريدونشهر":"فريدونشهر","فلاورجان":"فلاورجان","فولادشهر":"فولادشهر","قمصر":"قمصر","قهجاورستان":"قهجاورستان","قهدريجان":"قهدريجان","کاشان":"کاشان","کامو و چوگان":"کامو و چوگان","کرکوند":"کرکوند","کليشادوسودرجان":"کليشادوسودرجان","کمشچه":"کمشچه","کمه":"کمه","کوشک":"کوشک","کوهپايه":"کوهپايه","کهريزسنگ":"کهريزسنگ","گرگاب":"گرگاب","گزبرخوار":"گزبرخوار","گلپايگان":"گلپايگان","گلدشت":"گلدشت","گلشن":"گلشن","گلشهر":"گلشهر","گوگد":"گوگد","لاي بيد":"لاي بيد","مبارکه":"مبارکه","مجلسي":"مجلسي","محمدآباد":"محمدآباد","مشکات":"مشکات","منظريه":"منظريه","مهاباد":"مهاباد","ميمه":"ميمه","نايين":"نايين","نجف آباد":"نجف آباد","نصرآباد":"نصرآباد","نطنز":"نطنز","نوش آباد":"نوش آباد","نياسر":"نياسر","نيک آباد":"نيک آباد","ورزنه":"ورزنه","ورنامخواست":"ورنامخواست","وزوان":"وزوان","ونک":"ونک","هرند":"هرند"};
            break;
        case "البرز":
            var selectValues = {"اشتهارد":"اشتهارد","آسارا":"آسارا","تنکمان":"تنکمان","چهارباغ":"چهارباغ","شهرجديدهشتگرد":"شهرجديدهشتگرد","طالقان":"طالقان","فرديس":"فرديس","کرج":"کرج","کمال شهر":"کمال شهر","کوهسار":"کوهسار","گرمدره":"گرمدره","گلسار":"گلسار","ماهدشت":"ماهدشت","محمدشهر":"محمدشهر","مشکين دشت":"مشکين دشت","نظرآباد":"نظرآباد","هشتگرد":"هشتگرد"};
            break;
        case "ایلام":
            var selectValues = {"اركواز":"اركواز","ايلام":"ايلام","ايوان":"ايوان","آبدانان":"آبدانان","آسمان آباد":"آسمان آباد","بدره":"بدره","بلاوه":"بلاوه","پهله":"پهله","توحيد":"توحيد","چوار":"چوار","دره شهر":"دره شهر","دلگشا":"دلگشا","دهلران":"دهلران","زرنه":"زرنه","سراب باغ":"سراب باغ","سرابله":"سرابله","شباب":"شباب","صالح آباد":"صالح آباد","لومار":"لومار","ماژين":"ماژين","مورموری":"مورموری","موسيان":"موسيان","مهر":"مهر","مهران":"مهران","ميمه":"ميمه"};
            break;
        case "بوشهر":
            var selectValues = {"امام حسن":"امام حسن","انارستان":"انارستان","اهرم":"اهرم","آب پخش":"آب پخش","آباد":"آباد","آبدان":"آبدان","بادوله":"بادوله","برازجان":"برازجان","بردخون":"بردخون","بردستان":"بردستان","بندردير":"بندردير","بندرديلم":"بندرديلم","بندرريگ":"بندرريگ","بندركنگان":"بندركنگان","بندرگناوه":"بندرگناوه","بنك":"بنك","بوشکان":"بوشکان","بوشهر":"بوشهر","تنگ ارم":"تنگ ارم","جم":"جم","چغادك":"چغادك","خارك":"خارك","خورموج":"خورموج","دالكي":"دالكي","دلوار":"دلوار","دوراهک":"دوراهک","ريز":"ريز","سعد آباد":"سعد آباد","سيراف":"سيراف","شبانكاره":"شبانكاره","شنبه":"شنبه","عسلويه":"عسلويه","كاكي":"كاكي","كلمه":"كلمه","نخل تقي":"نخل تقي","وحدتيه":"وحدتيه"};
            break;
        case "تهران":
            var selectValues = {"احمد آباد مستوفي":"احمد آباد مستوفي","ارجمند":"ارجمند","اسلامشهر":"اسلامشهر","انديشه":"انديشه","آبسرد":"آبسرد","آبعلي":"آبعلي","باغستان":"باغستان","باقرشهر":"باقرشهر","بومهن":"بومهن","پاكدشت":"پاكدشت","پرديس":"پرديس","پرند":"پرند","پيشوا":"پيشوا","تجريش":"تجريش","تهران":"تهران","جوادآباد":"جوادآباد","چهاردانگه":"چهاردانگه","حسن آباد":"حسن آباد","دماوند":"دماوند","رباط كريم":"رباط كريم","رودهن":"رودهن","ری":"ری","شاهدشهر":"شاهدشهر","شريف آباد":"شريف آباد","شمشک":"شمشک","شهريار":"شهريار","صالحيه":"صالحيه","صباشهر":"صباشهر","صفادشت":"صفادشت","فردوسيه":"فردوسيه","فرون اباد":"فرون اباد","فشم":"فشم","فيروزكوه":"فيروزكوه","قدس":"قدس","قرچک":"قرچک","كهريزك":"كهريزك","كيلان":"كيلان","گلستان":"گلستان","لواسان":"لواسان","ملارد":"ملارد","نسيم شهر":"نسيم شهر","نصيرشهر":"نصيرشهر","وحيديه":"وحيديه","ورامين":"ورامين"};
            break;
        case "چهارمحال‌و‌بختیاری":
            var selectValues = {"اردل":"اردل","آلوني":"آلوني","باباحيدر":"باباحيدر","بازفت":"بازفت","بروجن":"بروجن","بلداجي":"بلداجي","بن":"بن","پردنجان":"پردنجان","جونقان":"جونقان","چلگرد":"چلگرد","چليچه":"چليچه","دستنا":"دستنا","دشتک":"دشتک","سامان":"سامان","سرخون":"سرخون","سردشت":"سردشت","سفيددشت":"سفيددشت","سودجان":"سودجان","سورشجان":"سورشجان","شلمزار":"شلمزار","شهركرد":"شهركرد","صمصامي":"صمصامي","طاقانك":"طاقانك","فارسان":"فارسان","فرادبنه":"فرادبنه","فرخ شهر":"فرخ شهر","کاج":"کاج","كيان":"كيان","گندمان":"گندمان","گوجان":"گوجان","گهرو":"گهرو","لردگان":"لردگان","مال خليفه":"مال خليفه","منج":"منج","ناغان":"ناغان","نافچ":"نافچ","نقنه":"نقنه","وردنجان":"وردنجان","هاروني":"هاروني","هفشجان":"هفشجان"};
            break;
        case "خراسان‌جنوبی":
            var selectValues = {"ارسك":"ارسك","اسديه":"اسديه","اسفدن":"اسفدن","اسلاميه":"اسلاميه","آرين شهر":"آرين شهر","آيسك":"آيسك","بشرويه":"بشرويه","بيرجند":"بيرجند","حاجي آباد":"حاجي آباد","خضری دشت بياض":"خضری دشت بياض","خوسف":"خوسف","ديهوك":"ديهوك","زهان":"زهان","سرايان":"سرايان","سربيشه":"سربيشه","سه قلعه":"سه قلعه","شوسف":"شوسف","طبس":"طبس","طبس مسينا":"طبس مسينا","عشق آباد":"عشق آباد","فردوس":"فردوس","قائن":"قائن","قهستان":"قهستان","گزيك":"گزيك","محمدشهر":"محمدشهر","مود":"مود","نهبندان":"نهبندان","نيمبلوك":"نيمبلوك"};
            break;
        case "خراسان‌رضوی":
            var selectValues = {"احمدابادصولت":"احمدابادصولت","انابد":"انابد","باجگيران":"باجگيران","باخرز":"باخرز","بار":"بار","بايك":"بايك","بجستان":"بجستان","بردسكن":"بردسكن","بيدخت":"بيدخت","تايباد":"تايباد","تربت جام":"تربت جام","تربت حيدريه":"تربت حيدريه","جغتای":"جغتای","جنگل":"جنگل","چاپشلو":"چاپشلو","چكنه":"چكنه","چناران":"چناران","خرو":"خرو","خليل آباد":"خليل آباد","خواف":"خواف","داورزن":"داورزن","درگز":"درگز","درود":"درود","دولت آباد":"دولت آباد","رباط سنگ":"رباط سنگ","رشتخوار":"رشتخوار","رضويه":"رضويه","روداب":"روداب","ريوش":"ريوش","سبزوار":"سبزوار","سرخس":"سرخس","سفيدسنگ":"سفيدسنگ","سلامي":"سلامي","سلطان آباد":"سلطان آباد","سنگان":"سنگان","شادمهر":"شادمهر","شانديز":"شانديز","ششتمد":"ششتمد","شهرآباد":"شهرآباد","شهرزو":"شهرزو","صالح آباد":"صالح آباد","طرقبه":"طرقبه","عشق آباد":"عشق آباد","فرهادگرد":"فرهادگرد","فريمان":"فريمان","فيروزه":"فيروزه","فيض آباد":"فيض آباد","قاسم آباد":"قاسم آباد","قدمگاه":"قدمگاه","قلندرآباد":"قلندرآباد","قوچان":"قوچان","كاخك":"كاخك","كاريز":"كاريز","كاشمر":"كاشمر","كدكن":"كدكن","كلات":"كلات","كندر":"كندر","گلمكان":"گلمكان","گناباد":"گناباد","لطف آباد":"لطف آباد","مزدآوند":"مزدآوند","مشهد":"مشهد","مشهدريزه":"مشهدريزه","ملك آباد":"ملك آباد","نشتيفان":"نشتيفان","نصرآباد":"نصرآباد","نقاب":"نقاب","نوخندان":"نوخندان","نيشابور":"نيشابور","نيل شهر":"نيل شهر","همت آباد":"همت آباد","يونسي":"يونسي"};
            break;
        case "خراسان‌شمالی":
            var selectValues = {"اسفراين":"اسفراين","ايور":"ايور","آشخانه":"آشخانه","آوا":"آوا","بجنورد":"بجنورد","پيش قلعه":"پيش قلعه","تيتكانلو":"تيتكانلو","جاجرم":"جاجرم","چناران شهر":"چناران شهر","حصارگرمخان":"حصارگرمخان","درق":"درق","راز":"راز","زيارت":"زيارت","سنخواست":"سنخواست","شوقان":"شوقان","شيروان":"شيروان","صفي آباد":"صفي آباد","فاروج":"فاروج","قاضي":"قاضي","قوشخانه":"قوشخانه","گرمه":"گرمه","لوجلي":"لوجلي"};
            break;
        case "خوزستان":
            var selectValues = {"ابوحميظه":"ابوحميظه","اروندکنار":"اروندکنار","الوان":"الوان","الهايي":"الهايي","اميديه":"اميديه","انديمشک":"انديمشک","اهواز":"اهواز","ايذه":"ايذه","آبادان":"آبادان","آبژدان":"آبژدان","آزادي":"آزادي","آغاجاري":"آغاجاري","باغ ملک":"باغ ملک","بستان":"بستان","بندرامام خميني":"بندرامام خميني","بندرماهشهر":"بندرماهشهر","بهبهان":"بهبهان","بيدروبه":"بيدروبه","ترکالکي":"ترکالکي","تشان":"تشان","جايزان":"جايزان","جنت مکان":"جنت مکان","چغاميش":"چغاميش","چم گلک":"چم گلک","چمران":"چمران","چويبده":"چويبده","حر":"حر","حسينيه":"حسينيه","حمزه":"حمزه","حميديه":"حميديه","خرمشهر":"خرمشهر","خنافره":"خنافره","دارخوين":"دارخوين","دزفول":"دزفول","دهدز":"دهدز","رامشير":"رامشير","رامهرمز":"رامهرمز","رفيع":"رفيع","زهره":"زهره","سالند":"سالند","سرداران":"سرداران","سردشت":"سردشت","سماله":"سماله","سوسنگرد":"سوسنگرد","سياه منصور":"سياه منصور","شادگان":"شادگان","شاوور":"شاوور","شرافت":"شرافت","شمس آباد":"شمس آباد","شوش":"شوش","شوشتر":"شوشتر","شهر امام":"شهر امام","شيبان":"شيبان","صالح شهر":"صالح شهر","صفي آباد":"صفي آباد","صيدون":"صيدون","فتح المبين":"فتح المبين","قلعه تل":"قلعه تل","قلعه خواجه":"قلعه خواجه","کوت سيدنعيم":"کوت سيدنعيم","کوت عبداله":"کوت عبداله","گتوند":"گتوند","گلگير":"گلگير","گوريه":"گوريه","لالي":"لالي","مسجدسليمان":"مسجدسليمان","مشراگه":"مشراگه","مقاومت":"مقاومت","ملاثاني":"ملاثاني","منصوريه":"منصوريه","ميانرود":"ميانرود","ميداود":"ميداود","مينوشهر":"مينوشهر","ويس":"ويس","هفتگل":"هفتگل","هنديجان":"هنديجان","هويزه":"هويزه"};
            break;
        case "زنجان":
            var selectValues = {"ابهر":"ابهر","ارمغانخانه":"ارمغانخانه","آب بر":"آب بر","چورزق":"چورزق","حلب":"حلب","خرمدره":"خرمدره","دندي":"دندي","زرين آباد":"زرين آباد","زرين رود":"زرين رود","زنجان":"زنجان","سجاس":"سجاس","سلطانيه":"سلطانيه","سهرورد":"سهرورد","صايين قلعه":"صايين قلعه","قيدار":"قيدار","کرسف":"کرسف","گرماب":"گرماب","ماه نشان":"ماه نشان","نوربهار":"نوربهار","نيک پي":"نيک پي","هيدج":"هيدج"};
            break;
        case "سمنان":
            var selectValues = {"اميريه":"اميريه","ايوانكي":"ايوانكي","آرادان":"آرادان","بسطام":"بسطام","بيارجمند":"بيارجمند","دامغان":"دامغان","درجزين":"درجزين","ديباج":"ديباج","روديان":"روديان","سرخه":"سرخه","سمنان":"سمنان","شاهرود":"شاهرود","شهميرزاد":"شهميرزاد","کلاته":"کلاته","کهن آباد":"کهن آباد","كلاته خيج":"كلاته خيج","گرمسار":"گرمسار","مجن":"مجن","مهدی شهر":"مهدی شهر","ميامي":"ميامي"};
            break;
        case "سیستان‌و‌بلوچستان":
            var selectValues = {"اديمي":"اديمي","اسپكه":"اسپكه","ايرانشهر":"ايرانشهر","بزمان":"بزمان","بمپور":"بمپور","بنت":"بنت","بنجار":"بنجار","پيشين":"پيشين","جالق":"جالق","چاه بهار":"چاه بهار","خاش":"خاش","دوست محمد":"دوست محمد","راسك":"راسك","زابل":"زابل","زابلي":"زابلي","زاهدان":"زاهدان","زرآباد":"زرآباد","زهك":"زهك","سراوان":"سراوان","سرباز":"سرباز","سوران":"سوران","سيركان":"سيركان","شهرک علي اکبر":"شهرک علي اکبر","فنوج":"فنوج","قصرقند":"قصرقند","كنارك":"كنارك","گشت":"گشت","گلمورتي":"گلمورتي","محمدان":"محمدان","محمدآباد":"محمدآباد","محمدي":"محمدي","ميرجاوه":"ميرجاوه","نصرت آباد":"نصرت آباد","نگور":"نگور","نوك آباد":"نوك آباد","نيك شهر":"نيك شهر","هيدوچ":"هيدوچ"};
            break;
        case "فارس":
            var selectValues = {"اردکان":"اردکان","ارسنجان":"ارسنجان","استهبان":"استهبان","اسير":"اسير","اشکنان":"اشکنان","افزر":"افزر","اقليد":"اقليد","امام شهر":"امام شهر","اوز":"اوز","اهل":"اهل","ايج":"ايج","ايزدخواست":"ايزدخواست","آباده":"آباده","آباده طشک":"آباده طشک","باب انار":"باب انار","بابامنير":"بابامنير","بالاده":"بالاده","بنارويه":"بنارويه","بوانات":"بوانات","بهمن":"بهمن","بيرم":"بيرم","بيضا":"بيضا","جنت شهر":"جنت شهر","جويم":"جويم","جهرم":"جهرم","حاجي آباد":"حاجي آباد","حسامي":"حسامي","حسن اباد":"حسن اباد","خانه زنيان":"خانه زنيان","خانيمن":"خانيمن","خاوران":"خاوران","خرامه":"خرامه","خشت":"خشت","خنج":"خنج","خور":"خور","خوزي":"خوزي","خومه زار":"خومه زار","داراب":"داراب","داريان":"داريان","دبيران":"دبيران","دژکرد":"دژکرد","دوبرجي":"دوبرجي","دوزه":"دوزه","دهرم":"دهرم","رامجرد":"رامجرد","رونيز":"رونيز","زاهدشهر":"زاهدشهر","زرقان":"زرقان","سده":"سده","سروستان":"سروستان","سعادت شهر":"سعادت شهر","سلطان شهر":"سلطان شهر","سورمق":"سورمق","سيدان":"سيدان","ششده":"ششده","شهرپير":"شهرپير","شهرصدرا":"شهرصدرا","شيراز":"شيراز","صغاد":"صغاد","صفاشهر":"صفاشهر","علامرودشت":"علامرودشت","عمادده":"عمادده","فدامي":"فدامي","فراشبند":"فراشبند","فسا":"فسا","فيروزآباد":"فيروزآباد","قادراباد":"قادراباد","قايميه":"قايميه","قره بلاغ":"قره بلاغ","قطب آباد":"قطب آباد","قطرويه":"قطرويه","قير":"قير","کارزين (فتح آباد)":"کارزين (فتح آباد)","کازرون":"کازرون","کامفيروز":"کامفيروز","کره اي":"کره اي","کنارتخته":"کنارتخته","کوار":"کوار","کوپن":"کوپن","کوهنجان":"کوهنجان","گراش":"گراش","گله دار":"گله دار","لار":"لار","لامرد":"لامرد","لپويي":"لپويي","لطيفي":"لطيفي","مادرسليمان":"مادرسليمان","مبارک آبادديز":"مبارک آبادديز","مرودشت":"مرودشت","مزايجان":"مزايجان","مشکان":"مشکان","مصيري":"مصيري","مهر":"مهر","ميانشهر":"ميانشهر","ميمند":"ميمند","نوبندگان":"نوبندگان","نوجين":"نوجين","نودان":"نودان","نورآباد":"نورآباد","ني ريز":"ني ريز","وراوي":"وراوي","هماشهر":"هماشهر"};
            break;
        case "قزوین":
            var selectValues = {"ارداق":"ارداق","اسفرورين":"اسفرورين","اقباليه":"اقباليه","الوند":"الوند","آبگرم":"آبگرم","آبيك":"آبيك","آوج":"آوج","بوئين زهرا":"بوئين زهرا","بيدستان":"بيدستان","تاكستان":"تاكستان","خاكعلي":"خاكعلي","خرمدشت":"خرمدشت","دانسفهان":"دانسفهان","رازميان":"رازميان","سگزآباد":"سگزآباد","سيردان":"سيردان","شال":"شال","شريفيه":"شريفيه","ضیاء آباد":"ضیاء آباد","قزوين":"قزوين","كوهين":"كوهين","محمديه":"محمديه","محمودآبادنمونه":"محمودآبادنمونه","معلم كلايه":"معلم كلايه","نرجه":"نرجه"};
            break;
        case "قم":
            var selectValues = {"جعفريه":"جعفريه","دستجرد":"دستجرد","سلفچگان":"سلفچگان","قم":"قم","قنوات":"قنوات","کهک":"کهک"};
            break;
        case "کردستان":
            var selectValues = {"اورامان تخت":"اورامان تخت","آرمرده":"آرمرده","بابارشاني":"بابارشاني","بانه":"بانه","برده رشه":"برده رشه","بلبان آباد":"بلبان آباد","بوئين سفلي":"بوئين سفلي","بيجار":"بيجار","پيرتاج":"پيرتاج","توپ آغاج":"توپ آغاج","چناره":"چناره","دزج":"دزج","دلبران":"دلبران","دهگلان":"دهگلان","ديواندره":"ديواندره","زرينه":"زرينه","سروآباد":"سروآباد","سريش آباد":"سريش آباد","سقز":"سقز","سنندج":"سنندج","شويشه":"شويشه","صاحب":"صاحب","قروه":"قروه","كامياران":"كامياران","كاني دينار":"كاني دينار","كاني سور":"كاني سور","مريوان":"مريوان","موچش":"موچش","ياسوكند":"ياسوكند"};
            break;
        case "کرمان":
            var selectValues = {"اختيارآباد":"اختيارآباد","ارزوئيه":"ارزوئيه","امين شهر":"امين شهر","انار":"انار","اندوهجرد":"اندوهجرد","باغين":"باغين","بافت":"بافت","بردسير":"بردسير","بروات":"بروات","بزنجان":"بزنجان","بلورد":"بلورد","بلوک":"بلوک","بم":"بم","بهرمان":"بهرمان","پاريز":"پاريز","جبالبارز":"جبالبارز","جوپار":"جوپار","جوزم":"جوزم","جيرفت":"جيرفت","چترود":"چترود","خاتون اباد":"خاتون اباد","خانوك":"خانوك","خواجو شهر":"خواجو شهر","خورسند":"خورسند","درب بهشت":"درب بهشت","دشتکار":"دشتکار","دوساري":"دوساري","دهج":"دهج","رابر":"رابر","راور":"راور","راين":"راين","رفسنجان":"رفسنجان","رودبار":"رودبار","ريحان":"ريحان","زرند":"زرند","زنگي آباد":"زنگي آباد","زهکلوت":"زهکلوت","زيدآباد":"زيدآباد","سيرجان":"سيرجان","شهداد":"شهداد","شهربابك":"شهربابك","صفائيه":"صفائيه","عنبرآباد":"عنبرآباد","فارياب":"فارياب","فهرج":"فهرج","قلعه گنج":"قلعه گنج","كاظم آباد":"كاظم آباد","كرمان":"كرمان","كشكوئيه":"كشكوئيه","كوهبنان":"كوهبنان","كهنوج":"كهنوج","كيانشهر":"كيانشهر","گلباف":"گلباف","گلزار":"گلزار","گنبکي":"گنبکي","لاله زار":"لاله زار","ماهان":"ماهان","محمدآباد":"محمدآباد","محي آباد":"محي آباد","مردهك":"مردهك","مس سرچشمه":"مس سرچشمه","منوجان":"منوجان","نجف شهر":"نجف شهر","نرماشير":"نرماشير","نظام شهر":"نظام شهر","نگار":"نگار","نودژ":"نودژ","هجدك":"هجدك","هماشهر":"هماشهر","هنزا":"هنزا","يزدان شهر":"يزدان شهر"};
            break;
        case "کرمانشاه":
            var selectValues = {"ازگله":"ازگله","اسلام آبادغرب":"اسلام آبادغرب","بانوره":"بانوره","باينگان":"باينگان","بيستون":"بيستون","پاوه":"پاوه","تازه آباد":"تازه آباد","جوانرود":"جوانرود","حميل":"حميل","رباط":"رباط","روانسر":"روانسر","ريجاب":"ريجاب","سرپل ذهاب":"سرپل ذهاب","سرمست":"سرمست","سطر":"سطر","سنقر":"سنقر","سومار":"سومار","شاهو":"شاهو","صحنه":"صحنه","قصرشيرين":"قصرشيرين","کرمانشاه":"کرمانشاه","کرند":"کرند","کنگاور":"کنگاور","کوزران":"کوزران","گودين":"گودين","گهواره":"گهواره","گيلانغرب":"گيلانغرب","ميان راهان":"ميان راهان","نودشه":"نودشه","نوسود":"نوسود","هرسين":"هرسين","هلشي":"هلشي"};
            break;
        case "کهکیلویه‌و‌بویراحمد":
            var selectValues = {"باشت":"باشت","پاتاوه":"پاتاوه","چرام":"چرام","چيتاب":"چيتاب","دوگنبدان":"دوگنبدان","دهدشت":"دهدشت","ديشموك":"ديشموك","سرفارياب":"سرفارياب","سوق":"سوق","سي سخت":"سي سخت","قلعه رئيسي":"قلعه رئيسي","گراب سفلي":"گراب سفلي","لنده":"لنده","ليكك":"ليكك","مادوان":"مادوان","مارگون":"مارگون","ياسوج":"ياسوج"};
            break;
        case "گلستان":
            var selectValues = {"انبارآلوم":"انبارآلوم","اينچه برون":"اينچه برون","آزادشهر":"آزادشهر","آق قلا":"آق قلا","بندرتركمن":"بندرتركمن","بندرگز":"بندرگز","تاتارعليا":"تاتارعليا","جلين":"جلين","خان ببين":"خان ببين","دلند":"دلند","راميان":"راميان","سرخنكلاته":"سرخنكلاته","سنگدوين":"سنگدوين","سيمين شهر":"سيمين شهر","علي اباد":"علي اباد","فاضل آباد":"فاضل آباد","فراغي":"فراغي","كردكوی":"كردكوی","كلاله":"كلاله","گاليكش":"گاليكش","گرگان":"گرگان","گميش تپه":"گميش تپه","گنبدكاووس":"گنبدكاووس","مراوه":"مراوه","مزرعه":"مزرعه","مينودشت":"مينودشت","نگين شهر":"نگين شهر","نوده خاندوز":"نوده خاندوز","نوكنده":"نوكنده"};
            break;
        case "گیلان":
            var selectValues = {"احمدسرگوراب":"احمدسرگوراب","اسالم":"اسالم","اطاقور":"اطاقور","املش":"املش","آستارا":"آستارا","آستانه اشرفيه":"آستانه اشرفيه","بازار جمعه":"بازار جمعه","بره سر":"بره سر","بندرانزلي":"بندرانزلي","پره سر":"پره سر","توتكابن":"توتكابن","جيرنده":"جيرنده","چابكسر":"چابكسر","چاف و چمخاله":"چاف و چمخاله","چوبر":"چوبر","حويق":"حويق","خشكبيجار":"خشكبيجار","خمام":"خمام","ديلمان":"ديلمان","رانكوه":"رانكوه","رحيم آباد":"رحيم آباد","رستم آباد":"رستم آباد","رشت":"رشت","رضوانشهر":"رضوانشهر","رودبار":"رودبار","رودبنه":"رودبنه","رودسر":"رودسر","سنگر":"سنگر","سياهكل":"سياهكل","شفت":"شفت","شلمان":"شلمان","صومعه سرا":"صومعه سرا","فومن":"فومن","كلاچای":"كلاچای","كوچصفهان":"كوچصفهان","كومله":"كومله","كياشهر":"كياشهر","گوراب زرميخ":"گوراب زرميخ","لاهيجان":"لاهيجان","لشت نشاء":"لشت نشاء","لنگرود":"لنگرود","لوشان":"لوشان","لولمان":"لولمان","لوندويل":"لوندويل","ليسار":"ليسار","ماسال":"ماسال","ماسوله":"ماسوله","ماکلوان":"ماکلوان","مرجقل":"مرجقل","منجيل":"منجيل","واجارگاه":"واجارگاه","هشتپر (تالش)":"هشتپر (تالش)"};
            break;
        case "لرستان":
            var selectValues = {"ازنا":"ازنا","اشترينان":"اشترينان","الشتر":"الشتر","اليگودرز":"اليگودرز","بروجرد":"بروجرد","بيران شهر":"بيران شهر","پلدختر":"پلدختر","چالانچولان":"چالانچولان","چقابل":"چقابل","خرم آباد":"خرم آباد","درب گنبد":"درب گنبد","دورود":"دورود","زاغه":"زاغه","سپيددشت":"سپيددشت","سراب دوره":"سراب دوره","شول آباد":"شول آباد","فيروزآباد":"فيروزآباد","کوهدشت":"کوهدشت","کوهناني":"کوهناني","گراب":"گراب","معمولان":"معمولان","مومن آباد":"مومن آباد","نورآباد":"نورآباد","ويسيان":"ويسيان","هفت چشمه":"هفت چشمه"};
            break;
        case "مازندران":
            var selectValues = {"ارطه":"ارطه","امامزاده عبدالله":"امامزاده عبدالله","اميركلا":"اميركلا","ايزدشهر":"ايزدشهر","آلاشت":"آلاشت","آمل":"آمل","بابل":"بابل","بابلسر":"بابلسر","بلده":"بلده","بهشهر":"بهشهر","بهنمير":"بهنمير","پايين هولار":"پايين هولار","پل سفيد":"پل سفيد","پول":"پول","تنكابن":"تنكابن","جويبار":"جويبار","چالوس":"چالوس","چمستان":"چمستان","خرم آباد":"خرم آباد","خليل شهر":"خليل شهر","خوش رودپي":"خوش رودپي","دابودشت":"دابودشت","رامسر":"رامسر","رستمكلا":"رستمكلا","رويان":"رويان","رينه":"رينه","زرگرمحله":"زرگرمحله","زيرآب":"زيرآب","ساری":"ساری","سرخرود":"سرخرود","سلمان شهر":"سلمان شهر","سورك":"سورك","شيرگاه":"شيرگاه","شيرود":"شيرود","عباس اباد":"عباس اباد","فريدونكنار":"فريدونكنار","فريم":"فريم","قائم شهر":"قائم شهر","کجور":"کجور","کلارآباد":"کلارآباد","کلاردشت":"کلاردشت","کياکلا":"کياکلا","كتالم و سادات شهر":"كتالم و سادات شهر","كوهي خيل":"كوهي خيل","كياسر":"كياسر","گتاب":"گتاب","گزنك":"گزنك","گلوگاه":"گلوگاه","محمودآباد":"محمودآباد","مرزن آباد":"مرزن آباد","مرزيكلا":"مرزيكلا","نشتارود":"نشتارود","نكا":"نكا","نور":"نور","نوشهر":"نوشهر","هادي شهر":"هادي شهر","هچيرود":"هچيرود"};
            break;
        case "مرکزی":
            var selectValues = {"اراک":"اراک","آستانه":"آستانه","آشتيان":"آشتيان","آوه":"آوه","پرندک":"پرندک","تفرش":"تفرش","توره":"توره","جاورسيان":"جاورسيان","خشکرود":"خشکرود","خمين":"خمين","خنجين":"خنجين","خنداب":"خنداب","داودآباد":"داودآباد","دليجان":"دليجان","رازقان":"رازقان","زاويه":"زاويه","ساروق":"ساروق","ساوه":"ساوه","شازند":"شازند","شهباز":"شهباز","غرق آباد":"غرق آباد","فرمهين":"فرمهين","قورچي باشي":"قورچي باشي","کارچان":"کارچان","کميجان":"کميجان","مامونيه":"مامونيه","محلات":"محلات","مهاجران":"مهاجران","ميلاجرد":"ميلاجرد","نراق":"نراق","نوبران":"نوبران","نيمور":"نيمور","هندودر":"هندودر"};
            break;
        case "هرمزگان":
            var selectValues = {"ابوموسي":"ابوموسي","بستك":"بستك","بندرجاسك":"بندرجاسك","بندرعباس":"بندرعباس","بندرلنگه":"بندرلنگه","بيکاء":"بيکاء","پارسيان":"پارسيان","تازيان پايين":"تازيان پايين","تخت":"تخت","تيرور":"تيرور","جناح":"جناح","چارك":"چارك","حاجي اباد":"حاجي اباد","خمير":"خمير","درگهان":"درگهان","دشتي":"دشتي","دهبارز":"دهبارز","رويدر":"رويدر","زيارتعلي":"زيارتعلي","سردشت":"سردشت","سرگز":"سرگز","سندرك":"سندرك","سوزا":"سوزا","سيريك":"سيريك","فارغان":"فارغان","فين":"فين","قشم":"قشم","قلعه قاضي":"قلعه قاضي","کوهستک":"کوهستک","كنگ":"كنگ","كوشكنار":"كوشكنار","كيش":"كيش","گروک":"گروک","گوهران":"گوهران","لمزان":"لمزان","ميناب":"ميناب","هرمز":"هرمز","هشتبندی":"هشتبندی"};
            break;
        case "همدان":
            var selectValues = {"ازندريان":"ازندريان","اسدآباد":"اسدآباد","آجين":"آجين","برزول":"برزول","بهار":"بهار","تويسركان":"تويسركان","جورقان":"جورقان","جوكار":"جوكار","دمق":"دمق","رزن":"رزن","زنگنه":"زنگنه","سامن":"سامن","سركان":"سركان","شيرين سو":"شيرين سو","صالح آباد":"صالح آباد","فامنين":"فامنين","فرسفج":"فرسفج","فيروزان":"فيروزان","قروه درجزين":"قروه درجزين","قهاوند":"قهاوند","کبودرآهنگ":"کبودرآهنگ","گل تپه":"گل تپه","گيان":"گيان","لالجين":"لالجين","مريانج":"مريانج","ملاير":"ملاير","مهاجران":"مهاجران","نهاوند":"نهاوند","همدان":"همدان"};
            break;
        case "یزد":
            var selectValues = {"ابركوه":"ابركوه","احمدآباد":"احمدآباد","اردكان":"اردكان","اشكذر":"اشكذر","بافق":"بافق","بفروييه":"بفروييه","بهاباد":"بهاباد","تفت":"تفت","حميديا":"حميديا","خضرآباد":"خضرآباد","زارچ":"زارچ","شاهديه":"شاهديه","عقدا":"عقدا","مروست":"مروست","مهردشت":"مهردشت","مهريز":"مهريز","ميبد":"ميبد","ندوشن":"ندوشن","نير":"نير","هرات":"هرات","يزد":"يزد"};
            break;
        case "":
            var selectValues = {"":""}

    }


    $.each( selectValues , function (key, value) {
        $(".temp09120217432class")
            .append($("<option></option>")
                .attr("value", key)
                .text(value));
    });
    $(".temp09120217432class").removeClass("temp09120217432class");
}
